* TODO Permitted lines
+ Extract O II and C II lines from MUSE
+ For the O II lines, we need to isolate the 4649 blend
+ For C II pure recomb lines 
  + We have 4620 supposedly ?!
    + Very weak and there may be another line at 4621
  + Also 4803 but blended with N II and [Co II]
  + 5342.40 - very weak
  + 6151.43 - might be good
  + 6461.96 - weak but should be clear
    + This is definitely the best bet for C II lines
    + Escalante:2012a have it being all recombination
    + Whereas 7231 and 7236 are 20 to 40% fluorescent in IC 418
+ N II lines
  + These are generally weak and must be a mixture of recombination and fluorescence
+ Si II lines
  + These are much stronger, also mixture
+ More O II lines from Manu/Adal
  + 4609, 4610 - Escalante:2012a says is 100% recombination
    + Terms are in LK coupling scheme
      + 3d 2D5/2–4f F[4]o7/2
      + 3d 2D3/2–4f F[2]o5/2
    + Unfortunately, there is an [Fe III] line at 4607
    + Also N II 4607 but that is weaker
    + 4607 to 4610 are blended in Manu and MUSE
    + The O II lines are well separated from [Fe III] in Adal
    + Discussed further below
  + 4596
+ [ ] Excitation of O II V1
  + Multiplet (quartet) is 3s ^4P \to 3p ^4D
    + Storey:2017a has more rigorous terminology
    + But backwards: UPPER \to LOWER
    + 2s^{2} 2p^{2}(.^{3}P) 3p .^{4}D_{o} \to  2s^{2} 2p^{2}(.^{3}P) 3s .^{4}P_{e}
    + ~2s22p2(3P)3p 4Do    -   2s22p2(3P)3s 4Pe~
    + E.g., 4649.13 is index 8790
  + Ground state is 2p3 ^4S
    + Resonant absorption 2p3 ^4S \to 3d ^4P (429.650 \to 429.716 \AA)
      + so that is 2.12 Rydbergs
    + Followed by decay to 3p terms
    + Need to make a diagram and work out if it is feasible
  + Velocity gradients in Big Arc will tend to make fluorescence more efficient
  + Interestingly, the analogous N I multiplet is at 8680-8719
    + N I and O II are identical in electron configuration
    + We see all these lines nicely in the MUSE data
    + They are all at least 95% fluoresced
    + [ ] We could look at the equivalent of the 3d-4f lines in N I
+ Case of the 3d-4f lines
  + These should not have a fluorescent component
    + /except that maybe they might if intercombination lines are important/
  + But they give the same abundances as the other lines (in Eduardo HH 529 data)
  + Strongest lines:
    + 4303.8: I \approx 0.63e-4 Hb  (Escalante:2013a)
      + Compare with 4649 \approx 6.7e-4 Hb
        + ODell:2010a have 4959/Hb = 0.7 to 1.0 in slits 10 and 11, which cover area of Adal's slit 6
        + Adal has 4649/4959 = 10 \to 12 times 1e-4
        + Eduardo (cut 2) has I(4649.13) = 11.4 in nebula and 24 in shock !!
      + Eduardo 4959/Hb in cut 2
        + 1.15 in nebula
        + 1.67 in shock
      + Seen in Manu data - about 5 times weaker than 4317 and 4320 (3s ^4P - 3p ^4P)
        + Which are themselves about 4 times weaker than V1
        + E.g., Manu has 4649 = 1.13 x cont
        + I(4304) = 0.01 x cont, so 13 x weaker than 4649 => I(4304) = 0.77 1e-4 I(Hb)
        + Within the errors, this is consistent with Escalante predicted, especially if we add in the 4303.5 contribution: 0.09 + 0.63 = 0.72
      + Observed in Eduardo: I = 2.0 (cut 3) and 2.1 (cut 2 neb), and 4.6 (cut 2 shock) !!!
    + 4277 complex
      + Strongest component: 4275.5 with predicted I = 0.84
        + Blended with [Fe II] 4276.84 in Manu
        + Observed in Eduardo with observed I = 1.6
    + 4609.3: predicted I \approx 0.66e-4 Hb  (Escalante:2013a)
      + Also, weaker component at 4610.2
      + Seen in Manu, but blend with [Fe III] 4607
      + Very well isolated in Adal: I(4609) = 1e-4 I(4959)
      + So this has observed intensity that maybe is slightly higher than predicted (by about 30%)
+ What states can we have
  + 3 outer electrons
  + Ground state is 2p^3 ^4S
    + 2S+1 = 4 => S = 3/2 so all 3 spins are aligned
    + L=0 so J = 3/2
  + Pumped state: one electron goes from 2p \to 3d
    + L = 0 \to 1 for E1 transition so must be a ^4P state
    + In fact *only* ^4P levels can be directly pumped from ground
      + At least I would have thought, although Escalante also mention ^4S \to ^4D transition, which has \Delta L = 2, so must be quadrupole
    + So 2p^2 3d ^4P has L=1, S=3/2, J= 5/2, 3/2, 1/2
  + If we pump the 3d .^{4}P level then we need the transition
    + 3d .^{4}P_{e} \to 3p .^{4}D_{o} in order to populate the upper level of V1
    + Storey has the following components:
      |  IND |     wav | 2JI | 2JF | Other         | Manu  |
      |------+---------+-----+-----+---------------+-------|
      | 8494 | 3864.13 |   1 |   1 | Si II 3863    | Blend |
      | 8493 | 3872.44 |   1 |   3 | [Ne III] 3869 |       |
      | 8515 | 3874.09 |   3 |   1 | He I 3878     |       |
      | 8514 | 3882.45 |   3 |   3 | H I 3889      | ?     |
      | 8566 | 3893.52 |   5 |   3 | H I 3889      |       |
      | 8513 | 3896.30 |   3 |   5 |               | faint |
      | 8565 | 3907.45 |   5 |   5 |               | yes   |
      | 8564 | 3926.58 |   5 |   7 | He I 3927     |       |
    + Unfortunately, most will be blended with other lines
  + We should also get another route down via 3p .^{4}S:
    + 3d .^{4}P_{e} \to 3p .^{4}S_{o} followed by 3p .^{4}S_{o} \to 3s .^{4}P_{e}
      + which ends at same lower level as V1
    + 3d .^{4}P_{e} \to 3p .^{4}S_{o} or ~2s22p2(3P)3d 4Pe    -   2s22p2(3P)3p 4So~
      |  IND |     wav | 2JI | 2JF | Other                    | Manu   | MUSE   | Adal              |
      |------+---------+-----+-----+--------------------------+--------+--------+-------------------|
      | 8489 | 4890.86 |   1 |   3 | [Fe II] 4890             | Blend? | Blend? | weak but resolved |
      | 8507 | 4906.83 |   3 |   3 | [Fe II] 4905             | Blend? | Blend  | Weak              |
      | 8559 | 4924.53 |   5 |   3 | He I 4922, [Fe III] 4925 | Blend? | No     | Possibly          |
    + 3p .^{4}S_{o} \to 3s .^{4}P_{e} or ~2s22p2(3P)3p 4So    -   2s22p2(3P)3s 4Pe~
      |  IND |     wav | 2JI | 2JF | Other       | Manu |
      |------+---------+-----+-----+-------------+------|
      | 8730 | 3712.74 |   3 |   1 | H I 3712    | No   |
      | 8729 | 3727.32 |   3 |   3 | [O II] 3726 | No   |
      | 8728 | 3749.48 |   3 |   5 | H I 3750    | No   |
    + So this is the *cursed multiplet* - no chance of ever seeing it
** Summary of the types of O II lines and what they tell us
1) The singly-excited lines can be pumped by radiative recombination or fluorescence
   - The low-L quartet transitions might have a fluorescent contribution
     + The s-pumped multiplets (descendants of 4s ^4P)
       + 4s ^4P \to 3p ^4D
       + include V1: 3p ^4D \to 3s ^4P
     + The d-pumped multiplets (descendants of 3d ^4P and 3d ^4D)
       + 3d ^4P,D \to 3p ^4P
       + 3p ^4P \to 3s ^4P
     + Note that the d-pumped lines have a small s-pumping contribution and vice-versa
   - The high-L transitions should be pure recombination
     - They are described by LK coupling instead of LS coupling
     - mainly 4f D,F,G \to 3d ^4P,D,F
   - The low-L doublet transitions can also have fluorescence (maybe)
2) The core-excited lines are mainly dielectronic recombination
   - But Escalante:2012a say that could also be other routes (including fluorescence)
   - They are called ~with parentage other than ^3P~ in Fang:2013a
     - They all have parentage of ^1D
   - Assuming that they are from DR, they can give T diagnostics
*** The four types of O++ temperature
1. T(CEL) : 4363 / 5007
   - Strongly biased to high-T
   - d R / d T > 0
2. T(ORL-CEL) : V1 Sum / 4959
   - Mostly unbiased (slightly to high-T)
   - d R / d T < 0
   - R increases with fluorescence
   - => T decreases with fluorescence
3. T(3d-4f) : V1 Sum / V48a Sum or 4649/4089
   - Biased to low-T
   - d R / d T > 0
   - R increases with fluorescence
   - => T increases with fluorescence
4. T(DR) : V1 Sum / V15 Sum or 4649/4591
   - Mostly unbiased (slightly low-T)
   - d R / d T < 0
   - R increases with fluorescence
   - => T decreases with fluorescence (?)
     - That is, assuming that V15 is not fluoresced

**** Expected T ordering from t^2 fluctuations 
+ T(3d-4f) < T(DR) ~= T(ORL-CEL) < T(CEL)
+ Example: NGC 7009
  + T(3d-4f) = 1000 K
  + T(DR) = 3000 K
  + T(ORL-CEL) = ?
  + T(CEL) = 10,000 K 

**** Expected T ordering from fluorescence
+ T(DR) < T(ORL-CEL) < T(CEL) < T(3d-4f)
  + Example: Orion (Eduardo nebula)
    + T(DR) = 4500 K
    + T(ORL-CEL) = 8000 K
    + T(CEL) = 8500 K
    + T(3d-4f) = 10,000 K
** Eduardo O II strengths

|             | 4590.97 | 4595.96 | 4649 | 4649/4591 | 4275.55 | 4649/4276 | 4189.79 | 4649/4190 | 4276/4591 | 4089.29 | 4649/4089 |
|-------------+---------+---------+------+-----------+---------+-----------+---------+-----------+-----------+---------+-----------|
| Cut 1 shock |         |         | 34.2 | 34.20 / 0 |         | 34.20 / 0 |         | 34.20 / 0 |       0/0 |         | 34.20 / 0 |
| Cut 2 shock |     4.2 |     2.0 | 25.8 |      6.14 |     2.8 |      9.21 |     4.7 |      5.49 |      0.67 |         | 25.80 / 0 |
| Cut 3 shock |     5.4 |         | 26.5 |      4.91 |         | 26.50 / 0 |     7.5 |      3.53 |      0.00 |         | 26.50 / 0 |
|-------------+---------+---------+------+-----------+---------+-----------+---------+-----------+-----------+---------+-----------|
| Cut 1 neb   |     2.7 |     2.2 | 11.2 |      4.15 |     1.4 |      8.00 |     2.3 |      4.87 |      0.52 |     2.5 |      4.48 |
| Cut 2 neb   |     2.4 |     2.0 | 12.2 |      5.08 |     1.7 |      7.18 |     2.0 |      6.10 |      0.71 |     3.1 |      3.94 |
| Cut 3 neb   |     2.4 |     1.5 | 12.9 |      5.38 |     1.6 |      8.06 |     2.1 |      6.14 |      0.67 |     2.6 |      4.96 |
| Cut 4       |     2.5 |     2.0 | 12.6 |      5.04 |     1.9 |      6.63 |     2.3 |      5.48 |      0.76 |     2.5 |      5.04 |
#+TBLFM: $5=$4/$2;f2::$7=$4/$6;f2::$9=$4/$8;f2::$10=$6/$2;f2::$12=$4/$11;f2

** Te, ne diagnostics from O II
+ Eduardo uses components of V1 as density indicator
  + This is fine and is what everyone does
+ Then they use 3d-4f lines 4089.29, 4275.55 as Te indicators
  + But 4089.29 is disfavored because it is affected by a ghost
  + Why these? The T sensitivity is not very high
  + Variation in ratio between 3000 \to 10000 K (Case B @ 1e4 pcc)
    1. 4649/4276: 5.58 \to 7.52 - factor of 1.35 increasing with T
       + 3s-3p / 3d-4f
    2. 4649/4089: 2.99 \to 3.98 - factor of 1.33 increasing with T
       + 3s-3p / 3d-4f
    3. 4649/4190: 5.59 \to 3.43 - factor of 1.63 decreasing with T
       + 3s-3p / DR 
    4. 4649/4591: 6.00 \to 3.70 - factor of 1.62 decreasing with T
       + 3s-3p / DR 
    5. 4276/4591: 1.08 \to 0.49 - factor of 2.20 decreasing with T
       + 3d-4f / DR
  + So, T-diagnostics 1 and 2 are what Eduardo uses
    + He gets values of 6.6 to 9.2 for 4649/4276, which would actually suggest T > 16,000 K for HH 529-II shock
    + Average nebula is 7.47 +/- 0.34, which gives 9800 +/- 1500 K, which is a bit high
    + Uncertainties are quite high however, so this is probably consistent with what is shown in Fig 8 of HH 529 paper
    + If there were a 20% fluorescence contribution to V1 as suggested by MUSE analysis, then this would bring the nebula ratio down to 6.23 +/- 0.28, which implies T = 5300 +/- 600 K, which is now a bit on the low side
    + For 4649/4089, average nebula is 4.60 +/- 0.25, which implies T = 15,200 +/- 2000 K
    + Again, with a 20% fluorescence contribution to 4649, this is reduced to 3.83 +/- 0.21 = T = 8900 +/- 1700 K
    + So averaging the 4649/4276 and 4649/4089 gives 12,500 +/- 2700 K, *or* 7100 +/- 2000 K after correcting for 20% fluorescence
  + T-diagnostics 3 and 4 are what Fang:2013a use for NGC 7009
    + Nebula has 4649/4591 = 4.15 \to 5.38 = 4.9 +/- 0.3 => T = 4500 +/- 500 K
    + Nebula has 4649/4190 = 4.87 \to 6.14 = 5.65 +/- 0.30 => T = 3100 +/- 200 K
    + With the 20% fluorescence correction, these become:
      + 4649/4591 = 4.1 +/- 0.2  => T = 7000 +/- 1000 K
      + 4649/4190 = 4.71 +/- 0.25 => T = 3900 +/- 500 K
    + This is better, but still too low, so maybe the fluorescence correction should be higher
  + Finally, T-diagnostic 5 should eliminate dependence on fluorescence (unless the DR lines are fluoresced)
    + Nebula 4276/4591 = 0.67 +/- 0.05 => T = 6000 +/- 700 K
    + So this is still a bit on the low side, especially since it is a lower limit if there is fluorescent contribution to V15 4591
+ Manu results
  + 4649/4591 is noisy but varies from 9.0 +/- 2.0 in inner nebula to 6.0 +/- 3.0 in outer nebula
    + V1-sum fractional excess is about 1.0 close to Trapezium and is about 0.5 in Big Arc
    + So this could mean that corrected 4649/4591 = 4.0 in both cases => T = 7500 +/- 4000 K
    + Yes, that makes sense
+ Adal results
  + 



** Theoretical recombination line ratios from Storey for Case B @ 1e4 pcc
+ The 3d-4f lines have a steeper fall of emissivity with T than the V1 lines
  + This gives one type of T diagnostic, such as 4649/4089 (V1/V48a) or 4649/4276 (V1/V67) 
  + E.g., Fig 17 of Fang:2013a, where the theoretical curve agrees reasonably well with what I have calculated from Storey (presumably because they use the same source)
    + Note that they measure 4649/4089 = 2.5 for Saturn Nebula, which is much lower than in Orion, and which implies a low T \approx 1000 - 1500 K
+ The ^1D parentage lines (core-excited) have an emissivity that rises with T (dielectronic recombination)
  + This gives the second type of T diagnostic, such as 4649/4591 (V1/V15) or 4649/4190 (V1/V36)
  + There are also M101 and M105 lines, but these are either weak or masked by other lines in Manu spectra
  + Also 4347 line (V16), but it is stuck among stronger lines of V2 (3s-3p ^4P) at 4345 and 4349

| log10(T) |   4089.29 |   4275.55 |   4649.13 | 4649/4276 | 4649/4089 |   4189.79 |   4189.58 | 4649/4190 |   4590.97 | 4649/4591 | 4276/4591 |
|----------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+-----------|
|    2.000 | 1.229E-23 | 7.288E-24 | 2.827E-23 |      3.88 |      2.30 | 1.680E-26 | 6.926E-28 |   1616.11 | 7.061E-26 |    400.37 | 103.21    |
|    2.100 | 9.925E-24 | 5.993E-24 | 2.270E-23 |      3.79 |      2.29 | 1.362E-26 | 5.075E-28 |   1606.80 | 5.696E-26 |    398.53 | 105.21    |
|    2.200 | 8.023E-24 | 4.872E-24 | 1.824E-23 |      3.74 |      2.27 | 1.105E-26 | 3.777E-28 |   1596.12 | 4.627E-26 |    394.21 | 105.30    |
|    2.300 | 6.351E-24 | 3.870E-24 | 1.443E-23 |      3.73 |      2.27 | 8.854E-27 | 2.810E-28 |   1579.64 | 3.731E-26 |    386.76 | 103.73    |
|    2.400 | 5.110E-24 | 3.080E-24 | 1.160E-23 |      3.77 |      2.27 | 7.259E-27 | 2.183E-28 |   1551.36 | 3.091E-26 |    375.28 | 99.64     |
|    2.500 | 4.097E-24 | 2.435E-24 | 9.339E-24 |      3.84 |      2.28 | 6.212E-27 | 1.909E-28 |   1458.56 | 2.626E-26 |    355.64 | 92.73     |
|    2.600 | 3.286E-24 | 1.923E-24 | 7.555E-24 |      3.93 |      2.30 | 6.740E-27 | 2.900E-28 |   1074.68 | 2.444E-26 |    309.12 | 78.68     |
|    2.700 | 2.639E-24 | 1.521E-24 | 6.150E-24 |      4.04 |      2.33 | 1.204E-26 | 8.153E-28 |    478.40 | 2.859E-26 |    215.11 | 53.20     |
|    2.800 | 2.120E-24 | 1.205E-24 | 5.031E-24 |      4.18 |      2.37 | 2.754E-26 | 2.295E-27 |    168.63 | 4.359E-26 |    115.42 | 27.64     |
|    2.900 | 1.701E-24 | 9.577E-25 | 4.130E-24 |      4.31 |      2.43 | 5.714E-26 | 5.130E-27 |     66.32 | 7.246E-26 |     57.00 | 13.22     |
|    3.000 | 1.368E-24 | 7.610E-25 | 3.406E-24 |      4.48 |      2.49 | 9.909E-26 | 9.173E-27 |     31.46 | 1.129E-25 |     30.17 | 6.74      |
|    3.100 | 1.098E-24 | 6.051E-25 | 2.817E-24 |      4.66 |      2.57 | 1.446E-25 | 1.357E-26 |     17.81 | 1.562E-25 |     18.03 | 3.87      |
|    3.200 | 8.801E-25 | 4.809E-25 | 2.334E-24 |      4.85 |      2.65 | 1.834E-25 | 1.727E-26 |     11.63 | 1.926E-25 |     12.12 | 2.50      |
|    3.300 | 7.032E-25 | 3.816E-25 | 1.934E-24 |      5.07 |      2.75 | 2.087E-25 | 1.952E-26 |      8.47 | 2.157E-25 |      8.97 | 1.77      |
|    3.400 | 5.595E-25 | 3.019E-25 | 1.603E-24 |      5.31 |      2.87 | 2.193E-25 | 2.012E-26 |      6.70 | 2.244E-25 |      7.14 | 1.35      |
|    3.500 | 4.435E-25 | 2.381E-25 | 1.328E-24 |      5.58 |      2.99 | 2.182E-25 | 1.934E-26 |      5.59 | 2.214E-25 |      6.00 | 1.08      |
|    3.600 | 3.495E-25 | 1.871E-25 | 1.099E-24 |      5.87 |      3.14 | 2.092E-25 | 1.764E-26 |      4.84 | 2.107E-25 |      5.22 | 0.89      |
|    3.700 | 2.743E-25 | 1.463E-25 | 9.083E-25 |      6.21 |      3.31 | 1.953E-25 | 1.547E-26 |      4.31 | 1.954E-25 |      4.65 | 0.75      |
|    3.800 | 2.142E-25 | 1.139E-25 | 7.502E-25 |      6.59 |      3.50 | 1.786E-25 | 1.318E-26 |      3.91 | 1.776E-25 |      4.22 | 0.64      |
|    3.900 | 1.665E-25 | 8.827E-26 | 6.197E-25 |      7.02 |      3.72 | 1.600E-25 | 1.098E-26 |      3.62 | 1.584E-25 |      3.91 | 0.56      |
|    4.000 | 1.289E-25 | 6.812E-26 | 5.124E-25 |      7.52 |      3.98 | 1.402E-25 | 8.974E-27 |      3.43 | 1.385E-25 |      3.70 | 0.49      |
|    4.100 | 9.936E-26 | 5.236E-26 | 4.255E-25 |      8.13 |      4.28 | 1.201E-25 | 7.217E-27 |      3.34 | 1.184E-25 |      3.59 | 0.44      |
|    4.200 | 7.644E-26 | 4.015E-26 | 3.568E-25 |      8.89 |      4.67 | 1.004E-25 | 5.714E-27 |      3.36 | 9.901E-26 |      3.60 | 0.41      |
|    4.300 | 5.915E-26 | 3.094E-26 | 3.059E-25 |      9.89 |      5.17 | 8.202E-26 | 4.456E-27 |      3.54 | 8.115E-26 |      3.77 | 0.38      |
|    4.400 | 4.707E-26 | 2.448E-26 | 2.740E-25 |     11.19 |      5.82 | 6.552E-26 | 3.424E-27 |      3.97 | 6.575E-26 |      4.17 | 0.37      |
|----------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+-----------|
#+TBLFM: $5=$4/$3;f2::$6=$4/$2;f2::$9=$4/($7+$8);f2::$12=$3/$10;f2

** Potential diagnostics of fluorescence
*** Other 3d-4f lines that Eduardo uses in his Table 13
+ Values given as (Storey XXX) are effective recomb rates for Case B at 1e4 K and 1e4 pcc
+ 4087.15
  + Manu sees blend at 4085
    + 4085.11 3p ^4D - 3d ^4F (feeds into V1) (Storey 6.2e-26)
    + 4086.59 3d ^4F - 4f D 2[2] (Storey 8.5e-28)
    + 4086.71 3d ^4F - 4f D 2[2] (Storey 3.6e-29)
    + 4087.15 3d ^4F - 4f G 2[3] (Storey 4.4e-26)
    + 4087.56 3p ^2P - 4s ^4P (Storey 1.4e-31) intercombination
  + Eduardo sees 4085.11 and 4087.15 with same strength in nebula: 1.8e-4 Hb
+ 4089.29
  + Manu sees blend
    + 4088.27 3d ^4F - 4f G 2[5] (Storey 2.4e-27)
    + 4089.29 3d ^4F - 4f G 2[5] (Storey 1.29e-25)
    + 4090.27 3p ^2D - 4d ^4F (Storey 2.5e-30)
    + 4092.93 3p ^4D - 3d ^4F (Storey 4.2e-26)
+ 4095.64
+ 4097.26
+ 4275.55
*** O II V1 / 4610
+ This can be measured in Adal slits easily
+ Trickier in Manu because of blend with [Fe III] 4607
+ Take 4649 / 4609 to be definite
+ 4610 is a blend:
  + 4609.44 3d.^{2}D_e - 4f F 2[4]
  + 4610.20 3d.^{2}D_e - 4f F 2[2]
+ 4649 is
  + 4649.13 V1 3s.^{4}P - 3p.^{4}D_o
+ Adal measurements - units of 1e-4 I(4959)
  | Zone | 4649 | 4610 | 4649/4610 |
  |------+------+------+-----------|
  | A    | 11.4 |  1.2 |      9.50 |
  | B    | 12.8 |  1.0 |     12.80 |
  | C    | 12.8 |  1.0 |     12.80 |
  | D    | 10.6 |  1.0 |     10.60 |
  | E    | 10.7 |  1.1 |      9.73 |
  | F    | 10.4 |  1.2 |      8.67 |
  #+TBLFM: $4=$2/$3;f2
+ UVES observations (Adal HH202 and Eduardo HH529 are missing the 4610 lines)
+ Storey recomb ratios
  + Case B, 3000-1e4 K, 1e4 pcc: 
    |   T |   4649.13 |   4609.44 |   4610.20 | 4649/4610 |
    |-----+-----------+-----------+-----------+-----------|
    | 3.5 | 1.328E-24 | 1.989E-25 | 5.794E-26 |      5.17 |
    | 3.6 | 1.099E-24 | 1.555E-25 | 4.562E-26 |      5.46 |
    | 3.7 | 9.083E-25 | 1.210E-25 | 3.578E-26 |      5.79 |
    | 3.8 | 7.502E-25 | 9.373E-26 | 2.793E-26 |      6.17 |
    | 3.9 | 6.197E-25 | 7.231E-26 | 2.170E-26 |      6.59 |
    | 4.0 | 5.124E-25 | 5.553E-26 | 1.678E-26 |      7.09 |
    #+TBLFM: $5=$2/($3+$4);f2
  + Case B, 3000-1e4 K, 1e3 pcc: 
    |   T |   4649.13 |   4609.44 |   4610.20 | 4649/4610 |
    |-----+-----------+-----------+-----------+-----------|
    | 3.5 | 9.742E-25 | 1.844E-25 | 5.151E-26 |      4.13 |
    | 3.6 | 7.725E-25 | 1.396E-25 | 3.960E-26 |      4.31 |
    | 3.7 | 6.114E-25 | 1.053E-25 | 3.030E-26 |      4.51 |
    | 3.8 | 4.832E-25 | 7.947E-26 | 2.303E-26 |      4.71 |
    | 3.9 | 3.823E-25 | 5.946E-26 | 1.746E-26 |      4.97 |
    | 4.0 | 3.031E-25 | 4.432E-26 | 1.318E-26 |      5.27 |
    #+TBLFM: $5=$2/($3+$4);f2
  + Case B, 3000-1e4 K, 1e5 pcc: 
    |   T |   4649.13 |   4609.44 |   4610.20 | 4649/4610 |
    |-----+-----------+-----------+-----------+-----------|
    | 3.5 | 1.407E-24 | 2.046E-25 | 5.929E-26 |      5.33 |
    | 3.6 | 1.172E-24 | 1.610E-25 | 4.683E-26 |      5.64 |
    | 3.7 | 9.757E-25 | 1.262E-25 | 3.684E-26 |      5.98 |
    | 3.8 | 8.122E-25 | 9.859E-26 | 2.885E-26 |      6.37 |
    | 3.9 | 6.758E-25 | 7.661E-26 | 2.248E-26 |      6.82 |
    | 4.0 | 5.627E-25 | 5.922E-26 | 1.743E-26 |      7.34 |
    #+TBLFM: $5=$2/($3+$4);f2



*** O II 4317 / 4304 
+ Ratio 
  + 4317.0: 3s.^{4}P_{1/2} - 3p.^{4}P_{3/2}^o
    + Minor contribution from 4317.7 3d-4f
    + Also 4319.6 of same multiplet
  + 4303.8: 3d.^{4}P_{5/2} - 4f.D[3]^o_{5/2}
+ Ratio from Escalante:2013a
  + With fluorescence: 1.58/0.63 = 2.51
  + Just recombination: 0.605 1.58/0.63 = 1.52
+ [X] Should check theoretical ratio from Storey
  + Full range is 0.56 to 1.2
  + Case B, 3000-1e4 K, 1e4 pcc: 
    |   T |   4303.82 |   4317.14 | 4317/4303 |
    |-----+-----------+-----------+-----------|
    | 3.5 | 2.236E-25 | 1.864E-25 | 0.83      |
    | 3.6 | 1.768E-25 | 1.534E-25 | 0.87      |
    | 3.7 | 1.397E-25 | 1.264E-25 | 0.90      |
    | 3.8 | 1.100E-25 | 1.042E-25 | 0.95      |
    | 3.9 | 8.619E-26 | 8.586E-26 | 1.00      |
    | 4.0 | 6.700E-26 | 7.073E-26 | 1.06      |
    #+TBLFM: $4=$3/$2;f2
  + Case B, 3000-1e4 K, 1e3 pcc:
    |   T |   4303.82 |   4317.14 | 4317/4303 |
    |-----+-----------+-----------+-----------|
    | 3.5 | 4.019E-25 | 2.261E-25 | 0.56      |
    | 3.6 | 3.309E-25 | 1.876E-25 | 0.57      |
    | 3.7 | 2.718E-25 | 1.557E-25 | 0.57      |
    | 3.8 | 2.222E-25 | 1.292E-25 | 0.58      |
    | 3.9 | 1.804E-25 | 1.071E-25 | 0.59      |
    | 4.0 | 1.453E-25 | 8.883E-26 | 0.61      |
    #+TBLFM: $4=$3/$2;f2
  + Case B, 3000-1e4 K, 1e5 pcc:
    |   T |   4303.82 |   4317.14 | 4317/4303 |
    |-----+-----------+-----------+-----------|
    | 3.5 | 2.051E-25 | 1.827E-25 |      0.89 |
    | 3.6 | 1.603E-25 | 1.501E-25 |      0.94 |
    | 3.7 | 1.251E-25 | 1.234E-25 |      0.99 |
    | 3.8 | 9.731E-26 | 1.013E-25 |      1.04 |
    | 3.9 | 7.529E-26 | 8.326E-26 |      1.11 |
    | 4.0 | 5.779E-26 | 6.836E-26 |      1.18 |
    #+TBLFM: $4=$3/$2;f2
+ Ratio from Manu
  + As high as 3
  + As low as 1
+ Ratio from Eduardo
  + cut 2 nebula: 0.028/0.021 = 1.33
  + cut 2 shock: 0.071/0.046 = 1.54
  + cut 3 nebula: 0.026/0.020 = 1.30
  + cut 1 nebula: 0.019/0.018 = 1.06
  + cut 4 nebula: 0.027/0.026 = 1.04
+ Ratio from Adal HH202
  + Nebula: 0.021/0.027 = 0.78 +/- 0.3
  + Shocks: 0.045/0.016 = 2.8 +/- 1
+ So in summary, the ratios are generally higher than the recombination predictions
** Analyze the pumping line
+ This is now in a separate file:
  + [[file:oii-fluorescence.org]]
** Revisiting the Adal and Manu analysis
+ The Adal spectra are plotted for 6 different sections of Slit 6
  | x range |         |
  |---------+---------|
  |    0:40 | Red bay |
  |   40:50 |         |
  |   50:62 |         |
  |   67:80 |         |
  |   80:95 |         |
  |  95:154 |         |
  + Numbers x correspond to pixels of length 1.2 arcsec along slit
  + Note that 62:67 is omitted - corresponds to 159-350
    + x=65 \to 78 arcsec from left edge
  + Total length = 154 1.2 = 185 arcsec
*** Adal's V1 line strengths
+ In units of 1e-4 I(4959) \approx 1e-4 I(Hb) in the bright zones
+ 4649: 10 \to 12
+ 4642: 7 \to 8
+ These are about 50% higher than predictions of Escalante:2012a for IC 418
+ More details are given down here in [[id:CD92418A-24FF-44D1-AF09-D5D09E84D1BA][Ratios within the V1 multiplet]]
  + Sum V1 = 32 \to 36 in these units
  + If interpreted in terms of recombination, this implies T = 7500 \to 7750 K

** Extract maps from MUSE cubes

+ This is copied from Raman project
  + [[id:90BA9F0F-DEF4-47FB-AE68-722524E169F1][Remove continuum from cube]]
+ But we change the wavelengths because we are working with wavsec0
  + Total range is 4595 \to 5191 \AA

#+begin_src python :tangle muse/subtract-continuum-wavsec0.py :eval no
  import sys
  import numpy as np
  from astropy.io import fits
  from astropy.wcs import WCS
  from numpy.polynomial import Chebyshev as T
  import itertools

  try:
      DATADIR = sys.argv[1]
      SUFFIX = sys.argv[2]
      OUTDIR = sys.argv[3]
  except IndexError:
      sys.exit(f"Usage: {sys.argv[0]} DATADIR SUFFIX OUTDIR")

  infile = f"muse-hr-data-wavsec0{SUFFIX}.fits"
  hdu = fits.open(f"{DATADIR}/{infile}")["DATA"]
  w = WCS(hdu)
  nwav, ny, nx = hdu.data.shape
  wavpix = np.arange(nwav)

  # Two pairs of adjacent sections for the true continuum

  # Wavelength sections of clean continuum (lots of small sections)
  clean_sections = [
      [4610.0, 4616.0], [4624.0, 4627.0], # between C II, N II, O II
      [4690.0, 4697.0], [4720.0, 4730.0], # between He I and Ar IV
      [4746.0, 4750.0], [4760.0, 4765.0], # between Fe III lines
      [4782.0, 4786.0], [4820.0, 4830.0], # next to Hb
      [4910.0, 4916.0], [5060.0, 5080.0], # to the red
      [5090.0, 5100.0], [5170.0, 5185.0], # to the red
  ]

  cont_slices = []
  for wavs in clean_sections:
      wavs = 1e-10*np.array(wavs)
      _, _, wpix = w.world_to_pixel_values([0, 0], [0, 0], wavs)
      cont_slices.append(slice(*wpix.astype(int)))


  # Use median over each section to avoid weak lines
  cont_maps = np.array([np.median(hdu.data[_, :, :], axis=0) for _ in cont_slices])
  cont_wavpix = np.array([np.median(wavpix[_], axis=0) for _ in cont_slices])
  # Inefficient but simple algorithm - loop over spaxels
  bgdata = np.empty_like(hdu.data)
  for j, i in itertools.product(range(ny), range(nx)):
      # Fit polynomial to BG
      try:
          p = T.fit(cont_wavpix, cont_maps[:, j, i], deg=2)
          # and fill in the BG spectrum of this spaxel
          bgdata[:, j, i] = p(wavpix)
      except:
          bgdata[:, j, i] = np.nan



  for suffix, cube in [
          ["cont", bgdata],
          ["cont-sub", hdu.data - bgdata],
          # ["cont-div", hdu.data/bgdata],
  ]:
      outfile = infile.replace(".fits", f"-{suffix}.fits")
      fits.PrimaryHDU(header=hdu.header, data=cube).writeto(
          f"{OUTDIR}/{outfile}", overwrite=True)
      print(f"Written {outfile}")
#+end_src

#+name: subtract-cont
#+header: :var DATADIR="../OrionMuse"
#+header: :var SUFFIX="-rebin05x05"
#+header: :var OUTDIR="../Orion-HH-data/MUSE"
#+begin_src sh :results verbatim
python muse/subtract-continuum-wavsec0.py $DATADIR $SUFFIX $OUTDIR
#+end_src

#+RESULTS: subtract-cont
: Written muse-hr-data-wavsec0-rebin05x05-cont.fits
: Written muse-hr-data-wavsec0-rebin05x05-cont-sub.fits


*** Now we do a simple extraction of the whole V1 multiplet

#+begin_src python :tangle muse/extract-o_ii-v1-sum.py :eval no
  import sys
  import numpy as np
  from astropy.io import fits
  from astropy.wcs import WCS

  try:
      DATADIR = sys.argv[1]
      SUFFIX = sys.argv[2]
      OUTDIR = sys.argv[3]
  except IndexError:
      sys.exit(f"Usage: {sys.argv[0]} DATADIR SUFFIX OUTDIR")

  infile = f"muse-hr-data-wavsec0{SUFFIX}-cont-sub.fits"
  outfile = f"o_ii-v1-sum{SUFFIX}.fits"
  hdu = fits.open(f"{DATADIR}/{infile}")["DATA"]
  w = WCS(hdu)
  nwav, ny, nx = hdu.data.shape


  # Wavelength sections of O II V1 multiplet
  v1_sections = [
      [49, 71], [79, 83], [90, 102]
  ]

  im = np.zeros((ny, nx))
  for i1, i2 in v1_sections:
      im += np.sum(hdu.data[i1:i2, :, :], axis=0)

  fits.PrimaryHDU(header=w.celestial.to_header(), data=im).writeto(
          f"{OUTDIR}/{outfile}", overwrite=True)
  print(f"Written {outfile}")
#+end_src

#+name: extract-o-ii-v1
#+header: :var DATADIR="../Orion-HH-data/MUSE"
#+header: :var SUFFIX="-rebin05x05"
#+header: :var OUTDIR="../Orion-HH-data/MUSE"
#+begin_src sh :results verbatim
python muse/extract-o_ii-v1-sum.py $DATADIR $SUFFIX $OUTDIR
#+end_src

#+RESULTS: extract-o-ii-v1
: Written o_ii-v1-sum.fits


*** Extraction of multiplet in 4 sections

#+name: oii-v1-sections
| pix1 | pix2 |    wav1 |    wav2 | O II V1 lines | Others                  | Label           |
|------+------+---------+---------+---------------+-------------------------+-----------------|
|   38 |   44 |  4627.3 |  4632.4 |               | N II 4631, [Ni II] 4628 | N_II-4631       |
|   44 |   49 |  4632.4 | 4636.65 |               | N III 4634              | N_III-4634      |
|   49 |   62 | 4636.65 |  4646.0 | 4639, 4642    | N III 4641, N II 4643   | O_II-V1-4639-42 |
|   62 |   71 |  4646.0 |  4654.5 | 4649, 4651    |                         | O_II-V1-4649-51 |
|   79 |   83 | 4662.15 |  4664.7 | 4662          | (Red wing of 4658)      | O_II-V1-4662    |
|   90 |  102 |  4671.5 | 4680.85 | 4674, 4676    |                         | O_II-V1-4674-76 |
|  101 |  119 | 4679.15 | 4694.45 |               | He II 4686 abs          | He_II-4686      |

#+header: :var TAB=oii-v1-sections
#+begin_src python :tangle muse/extract-o_ii-v1-sections.py :eval no
  import sys
  import numpy as np
  from astropy.io import fits
  from astropy.wcs import WCS

  try:
      DATADIR = sys.argv[1]
      SUFFIX = sys.argv[2]
      OUTDIR = sys.argv[3]
  except IndexError:
      sys.exit(f"Usage: {sys.argv[0]} DATADIR SUFFIX OUTDIR")

  infile = f"muse-hr-data-wavsec0{SUFFIX}-cont-sub.fits"
  infile_bg = f"muse-hr-data-wavsec0{SUFFIX}-cont.fits"
  hdu = fits.open(f"{DATADIR}/{infile}")["DATA"]
  hdubg = fits.open(f"{DATADIR}/{infile_bg}")["DATA"]
  w = WCS(hdu)
  nwav, ny, nx = hdu.data.shape
  wavpix = np.arange(nwav)
  _, _, wavs = w.pixel_to_world_values([0]*nwav, [0]*nwav, wavpix)
  wavs *= 1.e10
  for i1, i2, _, _, _, _, label in TAB:
      outfile = f"{label}-sum{SUFFIX}.fits"
      imsum = np.sum(hdu.data[i1:i2, :, :], axis=0)
      fits.PrimaryHDU(
          header=w.celestial.to_header(),
          data=imsum
      ).writeto(f"{OUTDIR}/{outfile}", overwrite=True)
      print(f"Written {outfile}")

      outfile = f"{label}-wav{SUFFIX}.fits"
      imwav = np.sum(hdu.data[i1:i2, :, :]*wavs[i1:i2, None, None], axis=0)/imsum
      fits.PrimaryHDU(
          header=w.celestial.to_header(),
          data=imwav
      ).writeto(f"{OUTDIR}/{outfile}", overwrite=True)
      print(f"Written {outfile}")

      outfile = f"{label}-bg{SUFFIX}.fits"
      imsum = np.sum(hdubg.data[i1:i2, :, :], axis=0)
      fits.PrimaryHDU(
          header=w.celestial.to_header(),
          data=imsum
      ).writeto(f"{OUTDIR}/{outfile}", overwrite=True)
      print(f"Written {outfile}")
#+end_src

#+name: extract-o-ii-v1-sections
#+header: :var DATADIR="../Orion-HH-data/MUSE"
#+header: :var SUFFIX="-rebin05x05"
#+header: :var OUTDIR="../Orion-HH-data/MUSE"
#+begin_src sh :results verbatim
python muse/extract-o_ii-v1-sections.py $DATADIR $SUFFIX $OUTDIR
#+end_src

#+RESULTS: extract-o-ii-v1-sections
#+begin_example
Written N_II-4631-sum-rebin05x05.fits
Written N_II-4631-wav-rebin05x05.fits
Written N_III-4634-sum-rebin05x05.fits
Written N_III-4634-wav-rebin05x05.fits
Written O_II-V1-4639-42-sum-rebin05x05.fits
Written O_II-V1-4639-42-wav-rebin05x05.fits
Written O_II-V1-4649-51-sum-rebin05x05.fits
Written O_II-V1-4649-51-wav-rebin05x05.fits
Written O_II-V1-4662-sum-rebin05x05.fits
Written O_II-V1-4662-wav-rebin05x05.fits
Written O_II-V1-4674-76-sum-rebin05x05.fits
Written O_II-V1-4674-76-wav-rebin05x05.fits
Written He_II-4686-sum-rebin05x05.fits
Written He_II-4686-wav-rebin05x05.fits
#+end_example



*** Do multibinning of V1 images

#+BEGIN_SRC python :tangle muse/multibin-map-orl.py :eval no
  import sys
  from pathlib import Path
  from distutils.dep_util import newer, newer_group
  import numpy as np
  sys.path.append("/Users/will/Dropbox/multibin-maps")
  from rebin_utils import downsample, oversample, pad_array
  from astropy.io import fits

  nlist = [1, 2, 4, 8, 16, 32, 64, 128, 256]
  mingoods = [2, 2, 2, 2, 2, 2, 2, 2, 2]


  try:
      datadir = Path(sys.argv[1])
      infile = sys.argv[2]
      contfile = sys.argv[3]
      cont_threshold = float(sys.argv[4])
  except:
      sys.exit('Usage: {} DATADIR INFILE CONTFILE CONT_THRESHOLD'.format(sys.argv[0]))


  hdu = fits.open(datadir / infile)[0]
  if hdu.data is None:
      hdu = fits.open(datadir / infile)[1]
  hdr = hdu.header
  # Maximum binning
  nmax = nlist[-1]

  # continuum image
  chdu = fits.open(datadir / contfile)[0]
  if chdu.data is None:
      chdu = fits.open(datadir / contfile)[1]

  # Pad arrays to nearest multiple of nmax
  im = pad_array(hdu.data, nmax)
  cim = pad_array(chdu.data, nmax)

  w = np.ones_like(im)
  starmask = cim > cont_threshold

  # If we pad the starmask and combine it with the padded image, then we
  # automatically deal with the case where the input files have already
  # been padded
  m =  np.isfinite(im) & (~pad_array(starmask, nmax))

  for n, mingood in zip(nlist, mingoods):
      im[~m] = 0.0
      outfile = infile.replace('.fits', '-bin{:03d}.fits'.format(n))
      print('Saving', outfile)
      # Save both the scaled image and the weights, but at the full resolution
      fits.HDUList([
          fits.PrimaryHDU(),
          fits.ImageHDU(data=oversample(im, n), header=hdr, name='scaled'),
          fits.ImageHDU(data=oversample(w, n), header=hdr, name='weight'),
      ]).writeto(datadir / outfile, clobber=True)
      # Now do the rebinning by a factor of two
      [im,], m, w = downsample([im,], m, weights=w, mingood=mingood)


#+END_SRC
 
#+begin_src sh :results verbatim
python muse/multibin-map-orl.py ../Orion-HH-data/MUSE O_II-V1-4649-51-sum.fits O_II-V1-4649-51-bg.fits 1.0e7
#+end_src

#+RESULTS:
: Saving O_II-V1-4649-51-sum-bin001.fits
: Saving O_II-V1-4649-51-sum-bin002.fits
: Saving O_II-V1-4649-51-sum-bin004.fits
: Saving O_II-V1-4649-51-sum-bin008.fits
: Saving O_II-V1-4649-51-sum-bin016.fits
: Saving O_II-V1-4649-51-sum-bin032.fits
: Saving O_II-V1-4649-51-sum-bin064.fits
: Saving O_II-V1-4649-51-sum-bin128.fits
: Saving O_II-V1-4649-51-sum-bin256.fits

#+begin_src sh :results verbatim
python muse/multibin-map-orl.py ../Orion-HH-data/MUSE O_II-V1-4639-42-sum.fits O_II-V1-4649-51-bg.fits 1.0e7
#+end_src

#+RESULTS:
: Saving O_II-V1-4639-42-sum-bin001.fits
: Saving O_II-V1-4639-42-sum-bin002.fits
: Saving O_II-V1-4639-42-sum-bin004.fits
: Saving O_II-V1-4639-42-sum-bin008.fits
: Saving O_II-V1-4639-42-sum-bin016.fits
: Saving O_II-V1-4639-42-sum-bin032.fits
: Saving O_II-V1-4639-42-sum-bin064.fits
: Saving O_II-V1-4639-42-sum-bin128.fits
: Saving O_II-V1-4639-42-sum-bin256.fits

#+begin_src sh :results verbatim
python muse/multibin-map-orl.py ../Orion-HH-data/MUSE N_III-4634-sum.fits O_II-V1-4649-51-bg.fits 1.0e7
#+end_src

#+RESULTS:
: Saving N_III-4634-sum-bin001.fits
: Saving N_III-4634-sum-bin002.fits
: Saving N_III-4634-sum-bin004.fits
: Saving N_III-4634-sum-bin008.fits
: Saving N_III-4634-sum-bin016.fits
: Saving N_III-4634-sum-bin032.fits
: Saving N_III-4634-sum-bin064.fits
: Saving N_III-4634-sum-bin128.fits
: Saving N_III-4634-sum-bin256.fits

#+begin_src sh :results verbatim
python muse/multibin-map-orl.py ../Orion-HH-data/MUSE N_II-4631-sum.fits O_II-V1-4649-51-bg.fits 1.0e7
#+end_src

#+RESULTS:
: Saving N_II-4631-sum-bin001.fits
: Saving N_II-4631-sum-bin002.fits
: Saving N_II-4631-sum-bin004.fits
: Saving N_II-4631-sum-bin008.fits
: Saving N_II-4631-sum-bin016.fits
: Saving N_II-4631-sum-bin032.fits
: Saving N_II-4631-sum-bin064.fits
: Saving N_II-4631-sum-bin128.fits
: Saving N_II-4631-sum-bin256.fits

#+begin_src sh :results verbatim
python muse/multibin-map-orl.py ../Orion-HH-data/MUSE He_II-4686-sum.fits O_II-V1-4649-51-bg.fits 1.0e7
#+end_src

#+RESULTS:
: Saving He_II-4686-sum-bin001.fits
: Saving He_II-4686-sum-bin002.fits
: Saving He_II-4686-sum-bin004.fits
: Saving He_II-4686-sum-bin008.fits
: Saving He_II-4686-sum-bin016.fits
: Saving He_II-4686-sum-bin032.fits
: Saving He_II-4686-sum-bin064.fits
: Saving He_II-4686-sum-bin128.fits
: Saving He_II-4686-sum-bin256.fits

#+begin_src sh :results verbatim
python muse/multibin-map-orl.py ../Orion-HH-data/MUSE linesum-O_III-5007.fits O_II-V1-4649-51-bg.fits 1.0e7
#+end_src

#+RESULTS:
: Saving linesum-O_III-5007-bin001.fits
: Saving linesum-O_III-5007-bin002.fits
: Saving linesum-O_III-5007-bin004.fits
: Saving linesum-O_III-5007-bin008.fits
: Saving linesum-O_III-5007-bin016.fits
: Saving linesum-O_III-5007-bin032.fits
: Saving linesum-O_III-5007-bin064.fits
: Saving linesum-O_III-5007-bin128.fits
: Saving linesum-O_III-5007-bin256.fits



**** Redo multibinning for extinction-corrected maps

Have a more generous continuum mask, since otherwise we get bad extinction around th2A

#+begin_src sh :results verbatim
  LINES="O_II-V1-4649-51-sum O_II-V1-4639-42-sum N_III-4634-sum N_II-4631-sum He_II-4686-sum linesum-O_III-5007"
  for line in $LINES; do
      python muse/multibin-map-orl.py ../Orion-HH-data/MUSE ${line}-excorr.fits O_II-V1-4649-51-bg.fits 2.0e6
  done
#+end_src

#+RESULTS:
#+begin_example
Saving O_II-V1-4649-51-sum-excorr-bin001.fits
Saving O_II-V1-4649-51-sum-excorr-bin002.fits
Saving O_II-V1-4649-51-sum-excorr-bin004.fits
Saving O_II-V1-4649-51-sum-excorr-bin008.fits
Saving O_II-V1-4649-51-sum-excorr-bin016.fits
Saving O_II-V1-4649-51-sum-excorr-bin032.fits
Saving O_II-V1-4649-51-sum-excorr-bin064.fits
Saving O_II-V1-4649-51-sum-excorr-bin128.fits
Saving O_II-V1-4649-51-sum-excorr-bin256.fits
Saving O_II-V1-4639-42-sum-excorr-bin001.fits
Saving O_II-V1-4639-42-sum-excorr-bin002.fits
Saving O_II-V1-4639-42-sum-excorr-bin004.fits
Saving O_II-V1-4639-42-sum-excorr-bin008.fits
Saving O_II-V1-4639-42-sum-excorr-bin016.fits
Saving O_II-V1-4639-42-sum-excorr-bin032.fits
Saving O_II-V1-4639-42-sum-excorr-bin064.fits
Saving O_II-V1-4639-42-sum-excorr-bin128.fits
Saving O_II-V1-4639-42-sum-excorr-bin256.fits
Saving N_III-4634-sum-excorr-bin001.fits
Saving N_III-4634-sum-excorr-bin002.fits
Saving N_III-4634-sum-excorr-bin004.fits
Saving N_III-4634-sum-excorr-bin008.fits
Saving N_III-4634-sum-excorr-bin016.fits
Saving N_III-4634-sum-excorr-bin032.fits
Saving N_III-4634-sum-excorr-bin064.fits
Saving N_III-4634-sum-excorr-bin128.fits
Saving N_III-4634-sum-excorr-bin256.fits
Saving N_II-4631-sum-excorr-bin001.fits
Saving N_II-4631-sum-excorr-bin002.fits
Saving N_II-4631-sum-excorr-bin004.fits
Saving N_II-4631-sum-excorr-bin008.fits
Saving N_II-4631-sum-excorr-bin016.fits
Saving N_II-4631-sum-excorr-bin032.fits
Saving N_II-4631-sum-excorr-bin064.fits
Saving N_II-4631-sum-excorr-bin128.fits
Saving N_II-4631-sum-excorr-bin256.fits
Saving linesum-O_III-5007-excorr-bin001.fits
Saving linesum-O_III-5007-excorr-bin002.fits
Saving linesum-O_III-5007-excorr-bin004.fits
Saving linesum-O_III-5007-excorr-bin008.fits
Saving linesum-O_III-5007-excorr-bin016.fits
Saving linesum-O_III-5007-excorr-bin032.fits
Saving linesum-O_III-5007-excorr-bin064.fits
Saving linesum-O_III-5007-excorr-bin128.fits
Saving linesum-O_III-5007-excorr-bin256.fits
#+end_example


*** Combine multibinned images 
+ Try a different strategy this time
  + Use a high s/n image, such as O_III-5007, as a template
  + Make a series of masks at different levels on this image
  + Use those to select the multigrid levels to combine

#+begin_src python :eval no :tangle muse/multibin-combine.py
  import sys
  from pathlib import Path
  import numpy as np
  from astropy.io import fits

  datadir = Path("~/Dropbox/Orion-HH-data/MUSE").expanduser()

  try:
      fileroot = sys.argv[1]
      threshold = float(sys.argv[2])
      STEEPNESS = float(sys.argv[3])
      SUFFIX = sys.argv[4]
  except IndexError:
      sys.exit(f'Usage: {sys.argv[0]} FILEROOT THRESHOLD STEEPNESS SUFFIX')


  refhdu = fits.open(datadir / "linesum-O_III-5007-bin001.fits")["SCALED"]
  outim = np.empty_like(refhdu.data)
  nlist = [1, 2, 4, 8, 16, 32, 64, 128, 256]
  for n in reversed(nlist):
      hdu = fits.open(datadir / f"{fileroot}-bin{n:03d}.fits")["SCALED"]
      mask = refhdu.data >= threshold/n**STEEPNESS
      outim[mask] = hdu.data[mask]

  fits.PrimaryHDU(
      header=hdu.header,
      data=outim,
  ).writeto(
      datadir / f"{fileroot}-multibin{SUFFIX}.fits",
      overwrite=True,
  )

#+end_src

#+begin_src sh :results silent
  LINES="O_II-V1-4649-51-sum O_II-V1-4639-42-sum N_III-4634-sum N_II-4631-sum linesum-O_III-5007"
  for line in $LINES; do
      python muse/multibin-combine.py ${line}-excorr 2e9 1.5 -coarse-2e9-1p5
  done
#+end_src


#+begin_src sh :results silent
  LINES="O_II-V1-4649-51-sum O_II-V1-4639-42-sum N_III-4634-sum N_II-4631-sum linesum-O_III-5007"
  for line in $LINES; do
      python muse/multibin-combine.py ${line}-excorr 1e9 1.5 -medium-1e9-1p5
  done
#+end_src

#+begin_src sh :results silent
  LINES="O_II-V1-4649-51-sum O_II-V1-4639-42-sum N_III-4634-sum N_II-4631-sum linesum-O_III-5007"
  for line in $LINES; do
      python muse/multibin-combine.py ${line}-excorr 3e8 1.5 -fine-3e8-1p5
  done
#+end_src

#+begin_src sh :results silent
  LINES="O_II-V1-4649-51-sum O_II-V1-4639-42-sum N_III-4634-sum N_II-4631-sum linesum-O_III-5007"
  for line in $LINES; do
      python muse/multibin-combine.py ${line}-excorr 1e8 1.5 -vfine-1e8-1p5
  done
#+end_src


This makes maps of the [S III] temperature on the same grids as used 

#+begin_src sh
line=muse-derived-Te-iii
python muse/multibin-combine.py ${line} 2e9 1.5 -coarse-2e9-1p5
python muse/multibin-combine.py ${line} 1e9 1.5 -medium-1e9-1p5
python muse/multibin-combine.py ${line} 3e8 1.5 -fine-3e8-1p5
python muse/multibin-combine.py ${line} 1e8 1.5 -vfine-1e8-1p5
#+end_src

#+RESULTS:

*** DONE Do extinction correction
CLOSED: [2020-07-26 Sun 15:22]
+ De-reddening must be done at the highest resolution, so before the multibinning
  + There is very little noise in the Balmer decrement map, so this is OK
+ In the Orion MUSE project I de-reddened [S III] 6313/9069 using Ha to Pa a
+ But then I did another version
  + [[id:7778E7D1-3209-481E-B301-163D5AEB8BAB][Do extinction correction for all lines]]
  + This used the Hb/Ha map and the Blagrave extinction law from pyneb



#+BEGIN_SRC python :eval no :tangle muse/correct-for-extinction.py
  import sys
  from pathlib import Path
  import numpy as np
  import pyneb
  from astropy.io import fits

  # Set up Blagrave 2007 extinction law
  REDCORR = pyneb.extinction.red_corr.RedCorr(
      law='CCM89 Bal07', R_V=5.5, cHbeta=1.0)

  def flambda(wav):
      """Find [(A_lam / A_Hb) - 1] as function of wavelength `wav`

      This is the same as given in Table 2 of Blagrave et al (2007)

      """
      return np.log10(REDCORR.getCorrHb(wav))


  def CHb_from_RHbHa(RHbHa, balmer0=2.874):
      """Find base-10 extinction at H beta from balmer decrement `RHbHa`

      Assumes that the intrinsic Balmer decrement is `balmer0`

      """
      return np.log10(balmer0*RHbHa) / flambda(6563)


  def CHb_from_R6563_9229(RBaPa, RBaPa0=112.0):
      """Find base-10 extinction at H beta from 6563/9229 decrement `RBaPa`

      Assumes that the intrinsic decrement is `RBaPa0`

      """
      return np.log10(RBaPa/RBaPa0) / (flambda(9229) - flambda(6563))



  DATADIR = Path("../Orion-HH-data/MUSE")

  if __name__ == '__main__':

      try:
          prefix = sys.argv[1]
          wav = int(sys.argv[2])
      except IndexError:
          print(f'Usage: {sys.argv[0]} LINEID WAV')

      hb_ha = fits.open(DATADIR / 'ratio-4861-6563.fits')[0].data
      chb = CHb_from_RHbHa(hb_ha)
      clam = (1.0 + flambda(wav))*chb
      fn = f"{prefix}.fits"
      hdu = fits.open(DATADIR / fn)[0]
      fn_new = f"{prefix}-excorr.fits"
      fits.PrimaryHDU(
          data=hdu.data*10**clam,
          header=hdu.header
      ).writeto(DATADIR / fn_new, overwrite=True)
      print(fn_new)

#+END_SRC

#+begin_src sh
python muse/correct-for-extinction.py linesum-O_III-5007 5007
#+end_src

#+RESULTS:
: linesum-O_III-5007-excorr.fits

#+begin_src sh
python muse/correct-for-extinction.py O_II-V1-4649-51-sum 4650
python muse/correct-for-extinction.py O_II-V1-4639-42-sum 4640
python muse/correct-for-extinction.py N_II-4631-sum 4631
python muse/correct-for-extinction.py N_III-4634-sum 4634
#+end_src

#+RESULTS:
| O_II-V1-4649-51-sum-excorr.fits |
| O_II-V1-4639-42-sum-excorr.fits |
| N_II-4631-sum-excorr.fits       |
| N_III-4634-sum-excorr.fits      |

*** DONE Subtract the N II and N III contamination from 4639-42 image
CLOSED: [2020-07-26 Sun 13:59]
+ Find scale factor from Adal spectra
  + N_II-4643 = 0.5 N_II-4631
  + N_III-4641 = 1.5 N_III-4634

*** Take ratio of V1 to 5007 for the two main sections
#+name: oii-v1-ratios-corrected
#+header: :var SUFFIX="excorr-multibin-coarse-2e9-1p5"
#+begin_src python 
  import sys
  import numpy as np
  from astropy.io import fits
  from astropy.wcs import WCS
  from pathlib import Path 

  datadir = Path("../Orion-HH-data/MUSE")
  hdu5007, = fits.open(datadir /  f"linesum-O_III-5007-{SUFFIX}.fits")
  hdu4650, = fits.open(datadir / f"O_II-V1-4649-51-sum-{SUFFIX}.fits")
  hdu4640, = fits.open(datadir / f"O_II-V1-4639-42-sum-{SUFFIX}.fits")
  hdu4631, = fits.open(datadir / f"N_II-4631-sum-{SUFFIX}.fits")
  hdu4634, = fits.open(datadir / f"N_III-4634-sum-{SUFFIX}.fits")

  fits.PrimaryHDU(
      header=hdu4650.header,
      data=hdu4650.data/hdu5007.data
  ).writeto(datadir / f"O_II-V1-4649-51-over-5007-{SUFFIX}.fits", overwrite=True)
  fits.PrimaryHDU(
      header=hdu4640.header,
      data=hdu4640.data/hdu5007.data
  ).writeto(datadir / f"O_II-V1-4639-42-over-5007-{SUFFIX}.fits", overwrite=True)
  fits.PrimaryHDU(
      header=hdu4650.header,
      data=hdu4650.data/hdu4640.data
  ).writeto(datadir / f"O_II-V1-4649-51-over-4639-42-{SUFFIX}.fits", overwrite=True)

  # Correct the 4639-42 for the N_II and N_III
  hdu4640.data -= 0.5*hdu4631.data + 1.5*hdu4634.data

  fits.PrimaryHDU(
      header=hdu4640.header,
      data=hdu4640.data/hdu5007.data
  ).writeto(datadir / f"O_II-V1-4639-42-minus-N_II_III-over-5007-{SUFFIX}.fits", overwrite=True)
  fits.PrimaryHDU(
      header=hdu4650.header,
      data=hdu4650.data/hdu4640.data
  ).writeto(datadir / f"O_II-V1-4649-51-over-4639-42-minus-N_II_III-{SUFFIX}.fits", overwrite=True)

#+end_src

#+RESULTS:
: None

#+call: oii-v1-ratios-corrected(SUFFIX="excorr-multibin-medium-1e9-1p5")

#+RESULTS:
: None

#+call: oii-v1-ratios-corrected(SUFFIX="excorr-multibin-fine-3e8-1p5")

#+RESULTS:
: None

#+call: oii-v1-ratios-corrected(SUFFIX="excorr-multibin-vfine-1e8-1p5")

#+RESULTS:
: None

** Ratios within the V1 multiplet
:PROPERTIES:
:ID:       CD92418A-24FF-44D1-AF09-D5D09E84D1BA
:END:
+ In the Manu spectra I calculated various ratios
  + Dominant feature is a radial gradient from inside to outside
  + Ratios are with respect to sum 4639+4649+4651+4662+4676
    + I think 4642 is not included because of contamination
    + And 4676 must include 4674
  + From the table below, the ratio of the blends 4650/4640 is only predicted to vary by 15%
    |     Ratio | Inner | Outer |
    |-----------+-------+-------|
    |      4639 |  0.14 |  0.17 |
    |      4642 |  0.38 |  0.34 |
    |-----------+-------+-------|
    |      4649 |  0.42 |  0.30 |
    |      4651 |  0.15 |  0.18 |
    |-----------+-------+-------|
    |      4662 |  0.15 |   0.2 |
    |      4676 |  0.10 |  0.10 |
    |-----------+-------+-------|
    |      4640 |  0.52 |  0.51 |
    |      4650 |  0.57 |  0.48 |
    | 4650/4640 |  1.10 |  0.94 |
    |-----------+-------+-------|
    #+TBLFM: @8$2..@8$3=vsum(@I..@II)::@9$2..@9$3=vsum(@II..@III)::@10$2..@10$3=@-1/@-2;f2
  + This is broadly consistent with what we get from MUSE
+ In the Adal spectra we have all the lines and 6 regions
  + Best to have the table transposed
  + Line strengths in units of 0.0001 with respect to 4959
    | Zone | 4639 | 4642 | 4649 | 4651 | 4662 | 4674 | 4676 |  Sum | 40+50/Sum | 50/40 | 50/5007 | 40/5007 |
    |------+------+------+------+------+------+------+------+------+-----------+-------+---------+---------|
    | A    |  4.0 |  8.3 | 11.4 |  4.0 |  4.9 |  0.9 |  2.9 | 36.4 |      0.76 |  1.25 |     5.3 |     4.2 |
    | B    |  4.6 |  8.1 | 12.8 |  4.2 |  4.9 |  0.9 |  2.9 | 38.4 |      0.77 |  1.34 |     5.8 |     4.4 |
    | C    |  4.5 |  8.3 | 12.8 |  4.5 |  5.0 |  0.9 |  2.8 | 38.8 |      0.78 |  1.35 |     5.9 |     4.4 |
    | D    |  3.8 |  7.2 | 10.6 |  3.5 |  4.0 |  0.8 |  2.4 | 32.3 |      0.78 |  1.28 |     4.8 |     3.8 |
    | E    |  3.9 |  7.2 | 10.7 |  3.7 |  4.0 |  0.7 |  2.3 | 32.5 |      0.78 |  1.30 |     4.9 |     3.8 |
    | F    |  5.0 |  8.5 | 10.4 |  5.1 |  5.4 |  1.1 |  3.3 | 38.8 |      0.75 |  1.15 |     5.3 |     4.6 |
    #+TBLFM: $9=vsum($2..$8)::$10=vsum($2..$5)/$9;f2::$11=($4+$5)/($2+$3);f2::$12=($4 + $5) / 2.91817;f1::$13=($2 + $3) / 2.91817;f1
  + So the absolute values of 50/40 are a bit larger than Manu's, but the trend is the same
    + Increases towards center
  + The sum of the 4640 blend and 4650 blend are about 0.77 of the total sum
    + There is a slight dependence on density, but the variation is only 4%


** Calculate a T from V1/5007 as in Peimbert-squared
+ Supposedly we have
  : Sum_V1/4959 = 6.56e-5*((T/1.e4)**-0.415)*np.exp(29160.0/T)
+ Theoretically: 5007/4959 = 2.91817
+ And we can estimate Sum_V1 = (4640 + 4650)/0.77
+ Make a table
  |     T | 1e4 Sum_V1/4959 |
  |-------+-----------------|
  |  6000 |           104.6 |
  |  6500 |            69.6 |
  |  7000 |            49.0 |
  |  7250 |            41.8 |
  |  7500 |            36.1 |
  |  7750 |            31.4 |
  |  8000 |            27.6 |
  |  8500 |            21.7 |
  |  9000 |            17.5 |
  | 10000 |            12.1 |
  | 11000 |             8.9 |
  | 12000 |             6.9 |
  #+TBLFM: $2=6.56e-5 (($1/1.e4)**-0.415) exp(29160.0/$1) 10000; f1
+ So the Adal measurements suggest T = 7500 +/- 200 K
  + [S III] measurements give T = 8500 +/- 300 K
  + This is consistent with the factor of 0.9 I found for T(4363/5007) vs T(V1/4959)
+ Convert our measurements into a T map
+ Also calculate difference and ratio with [S III] temperature
+ And finally, calculate "excess" V1 emission
  + That is calculate expected ratio V1/4959 from [S III] temperature
  + Then multiply this by S(4959) and subtract from S(V1)

#+name: oii-ORL-CEL-temperature
#+header: :var SUFFIX="multibin-medium-1e9-1p5"
#+begin_src python 
  import sys
  import numpy as np
  from astropy.io import fits
  from astropy.wcs import WCS
  from pathlib import Path 

  datadir = Path("../Orion-HH-data/MUSE")
  hdu4650, = fits.open(datadir / f"O_II-V1-4649-51-over-5007-excorr-{SUFFIX}.fits")
  hdu4640, = fits.open(datadir / f"O_II-V1-4639-42-minus-N_II_III-over-5007-excorr-{SUFFIX}.fits")
  hduTiii, = fits.open(datadir / f"muse-derived-Te-iii-{SUFFIX}.fits")
  hdu5007, = fits.open(datadir / f"linesum-O_III-5007-excorr-{SUFFIX}.fits")

  def func_ratio_v1_4959(T):
      return 6.56e-5*((T/1.e4)**-0.415)*np.exp(29160.0/T)

  # Grid of 10 K increments
  Tgrid = np.linspace(5000.0, 15000.0, 1001)
  Rgrid = func_ratio_v1_4959(Tgrid)
  # Reverse arrays since we need ratio in ascending order for np.interp
  Rgrid = Rgrid[::-1]
  Tgrid = Tgrid[::-1]

  RATIO_4640_50_OVER_SUM = 0.77
  RATIO_5007_4959 = 2.91817
  ratio_v1_4959 = RATIO_5007_4959*(hdu4640.data + hdu4650.data)/RATIO_4640_50_OVER_SUM

  T = np.interp(ratio_v1_4959, Rgrid, Tgrid)
  T[hdu4650.data < 0.0] = np.nan
  T[T == Tgrid.max()] = np.nan
  T[T == Tgrid.min()] = np.nan

  fits.PrimaryHDU(
      header=hdu4650.header,
      data=ratio_v1_4959
  ).writeto(datadir / f"O_II-V1-sum-over-4959-{SUFFIX}.fits", overwrite=True)
  fits.PrimaryHDU(
      header=hdu4650.header,
      data=T,
  ).writeto(datadir / f"T_Op2_ORL_CEL-{SUFFIX}.fits", overwrite=True)
  fits.PrimaryHDU(
      header=hdu4650.header,
      data=hduTiii.data - T,
  ).writeto(datadir / f"Delta_T-{SUFFIX}.fits", overwrite=True)
  fits.PrimaryHDU(
      header=hdu4650.header,
      data=T/hduTiii.data,
  ).writeto(datadir / f"T_ratio-{SUFFIX}.fits", overwrite=True)

  ratio_from_T_SIII = func_ratio_v1_4959(hduTiii.data)
  V1_from_T_S_III = ratio_from_T_SIII*hdu5007.data/RATIO_5007_4959
  V1_total = (hdu4640.data + hdu4650.data)*hdu5007.data/RATIO_4640_50_OVER_SUM
  V1_excess = V1_total - V1_from_T_S_III
  fits.PrimaryHDU(
      header=hdu4650.header,
      data=V1_excess,
  ).writeto(datadir / f"O_II-V1-sum-excess-{SUFFIX}.fits", overwrite=True)
  fits.PrimaryHDU(
      header=hdu4650.header,
      data=V1_excess/V1_from_T_S_III,
  ).writeto(datadir / f"O_II-V1-sum-frac-excess-{SUFFIX}.fits", overwrite=True)



#+end_src

#+RESULTS: oii-ORL-CEL-temperature
: None

#+call: oii-ORL-CEL-temperature(SUFFIX="multibin-coarse-2e9-1p5")

#+RESULTS:
: None

#+call: oii-ORL-CEL-temperature(SUFFIX="multibin-fine-3e8-1p5")

#+RESULTS:
: None

#+call: oii-ORL-CEL-temperature(SUFFIX="multibin-vfine-1e8-1p5")

#+RESULTS:
: None


*** Relation between \Delta T and t^2
+ This is for T([O III]) instead of T([S III]) but we will assume that is close enough
+ Peimbert & Peimbert (2013) equations 10, 11
  + give T(4363/4959) and T(V1/4959)
  + in terms of T_0(O++) and t^2(O++)
+ For convenience, put t0 = T_0/1e4 Koii
+ Then we have
  + T(4363/4959) / T_0 = 1 + 0.5 (9.13/t0 - 2.68) t^2 = 1 + a t^2
  + T(V1/4959) / T_0 = 1 + 0.5 (2.916/t0 - 3.095 + 0.415/(2.916/t0 + 0.415)) t^2 = 1 + b t^2
  + \Delta T / T_0 = (a - b) t^2
+ Variation of the t^2 coefficients with t0
  |   t0 |    a |    b | a - b |
  |------+------+------+-------|
  |  0.7 | 5.18 | 0.58 | 4.6   |
  | 0.75 | 4.75 | 0.44 | 4.31  |
  |  0.8 | 4.37 | 0.33 | 4.04  |
  | 0.85 | 4.03 | 0.22 | 3.81  |
  #+TBLFM: $2=0.5 (9.13/$1 - 2.68);f2::$3=0.5 (2.916/$1 - 3.095 + 0.415/(2.916/$1 + 0.415));f2::$4=$2 - $3
+ So both T are positively biased wrt mean T_0, especially T(4363/4959)
+ We expect T_0 to be similar to, but slightly lower than T(V1/4959)
  + Taking T_0 = 7500 +/- 200 K gives (a - b) = 4.31 +/- 0.12
  + This implies \Delta T = 7500 (4.31 +/- 0.12) t^2 = (32325 +/- 900) t^2 
  + Or t^2 = (0.031 +/- 0.001) (\Delta T / 1000 K)


*** Plane-of sky t^2
+ This can be crudely estimated from the standard deviation of T([S III])
+ Measured in a few representative boxes
  |  T mean |  stddev |    t^2 |
  |---------+---------+--------|
  |    8284 | 228.662 | 0.0008 |
  | 8222.34 | 267.187 | 0.0011 |
  | 8262.28 | 148.677 | 0.0003 |
  | 8165.87 |  314.53 | 0.0015 |
  |---------+---------+--------|
  | 7756.21 | 347.089 | 0.0020 |
  | 7690.31 |  183.44 | 0.0006 |
  | 7665.54 | 202.199 | 0.0007 |
  | 7658.65 | 218.946 | 0.0008 |
  #+TBLFM: $3=($2/$1)**2;f4
+ Below the line are from T(V1/4959), although only for medium and coarse gridding since otherwise noise dominates
+ Anyway, it looks like plane-of-sky t^2 is about 0.001 for either diagnostic
*** Combine the excess maps
+ Only allow positive values
#+begin_src python 
  import sys
  import numpy as np
  from astropy.io import fits
  from astropy.wcs import WCS
  from pathlib import Path 


  datadir = Path("../Orion-HH-data/MUSE")

  im = None
  for suffix in [
          "coarse-2e9-1p5",
          "medium-1e9-1p5",
          "fine-3e8-1p5",
  #        "vfine-1e8-1p5",
  ]:
      hdu, = fits.open(datadir / f"O_II-V1-sum-excess-multibin-{suffix}.fits")
      if im is None:
          im = np.empty_like(hdu.data)
      m = hdu.data > 0.0
      im[m] = hdu.data[m]

  fits.PrimaryHDU(
      header=hdu.header,
      data=im,
  ).writeto(datadir / f"O_II-V1-sum-excess-combo.fits", overwrite=True)
 
#+end_src

#+RESULTS:
: None

** Compare with C II fluorescent
+ Use the 6463 line to remove the recombination contribution from 7231
+ With O II, try to subtract a fraction of [O III] 5007 from 4651, assuming a T
+ The excess O II certainly looks very much like fluorescence
  + Many of the detailed morphologies are the same between O II and C II
+ The fractional excess is about 0.8 times the T(S_III) prediction in the Big Arc
  + But much higher around Trapezium
+ A more realistic approach would be to combine T(S_III) with a t^2 value derived from plane-of-sky variations
  + This might give a slightly larger predicted S(V1), so slightly less excess

** Look at the O I and [O II] lines
+ This gives another T estimate for the singly-ionized metals zone
** Fit Gaussians to O II multiple
+ 4649, 4651 are blended
+ 4642, 4639 are blended with N II and N III too
+ 4674 and 4676 are blended
+ 4631 is pure N II
+ 4607 is pure N II


*** Make a template for the O II V1 multiplet
